{
  "projects": [
    {
      "id": "qris",
      "title": "QR Information System (QRIS)",
      "status": "Completed",
      "statusBadge": "done",
      "tags": [
        "Python",
        "QR Contact Cards",
        "Employee Management",
        "Real-Time Updates",
        "Internal Tool"
      ],
      "summary": "An internal QR contact-card and employee management system built for quick access to staff details. Generates branded QR codes that link to a web-based contact card (phone, email, location, and website), enabling scan-to-view access and real-time updates when employee information changes.",
      "highlights": [
        "Generates branded QR contact cards that link directly to a web-based profile",
        "Employee management module for adding and updating staff information",
        "Real-time updates: changes reflect immediately when the QR is scanned",
        "Supports contact details such as phone, email, location, and website links",
        "Designed for quick-response use cases and faster internal communication",
        "Improves accessibility of staff information without manual searching"
      ],
      "imageSets": [
        { "folder": "images/projects", "prefix": "qr", "start": 1, "end": 14, "ext": "png" }
      ],
      "extraImages": [
        "images/projects/QR11.png"
      ],
      "video": "https://drive.google.com/file/d/1fR33KxPBGL9SSk6007WwnLnTSl9Gfhsp/view?usp=drive_link",
      "note": "Screenshots use fictional sample data for demonstration purposes only."
    },
    {
      "id": "inventory",
      "title": "Inventory Management System",
      "status": "In Progress",
      "statusBadge": "wip",
      "tags": [
        "Inventory Management",
        "Requisition & Issuance",
        "Asset Accountability",
        "Operational Systems",
        "Internal System"
      ],
      "summary": "An internal inventory management system designed to support organization-wide inventory operations, including real-time item availability viewing, employee requests, and issuance tracking. Supports both consumable items and non-consumable assets through structured requisition and issuance workflows aligned with operational processes.",
      "highlights": [
        "Real-time inventory tracking for consumable items and non-consumable assets",
        "Live item availability visibility and request submission for employees",
        "Synchronized requisition and issuance workflows with automatic inventory updates",
        "Automated generation of request, issuance, and receipt documentation",
        "Role-based workflows for supply officers and employee users",
        "Designed for daily operations, monitoring, and audit accountability"
      ],
      "imageSets": [
        { "folder": "images/projects", "prefix": "inventory", "start": 1, "end": 13, "ext": "png" }
      ],
      "extraImages": [
        "images/projects/inventory13resultview.png"
      ],
      "video": "https://drive.google.com/file/d/1ZgKHFBwk69K8mI2Ow7Ir8FSeXfnyssGq/view?usp=drive_link",
      "note": "Project is in progress and currently used for internal testing and workflow validation based on operational requirements. Screenshots use fictional sample data for demonstration purposes only."
    },
    {
      "id": "centraldeployment",
      "title": "Central Deployment System",
      "status": "In Progress",
      "statusBadge": "wip",
      "tags": [
        "Endpoint Management",
        "Remote Administration",
        "Software Deployment",
        "IT Operations",
        "Automation Scripts"
      ],
      "summary": "A centralized deployment and remote management system designed to support software installation, maintenance, and basic remote administrative actions on employee laptops and desktops. Built to improve response time, standardize fixes, and support daily IT operations through controlled automation and remote commands.",
      "highlights": [
        "Centralized install/uninstall of approved software across employee workstations",
        "Remote administrative actions including lock, restart, shutdown, and user notifications",
        "Remote troubleshooting support to speed up issue resolution and reduce onsite handling",
        "Automation scripts for common fixes (e.g., restarting print spooler, disk health checks)",
        "Controlled command execution using command-line and Bash-based scripts",
        "Designed to standardize IT support actions and reduce repetitive manual intervention"
      ],
      "imageSets": [
        { "folder": "images/projects", "prefix": "s", "start": 1, "end": 6, "ext": "png" }
      ],
      "extraImages": [],
      "video": "https://drive.google.com/file/d/1KY8G28P9ox-cvGHwOvrE2zJy3SttlEOK/view?usp=drive_link",
      "note": "Prototype stage; features are being refined and validated based on internal operational requirements."
    },
    {
      "id": "automation",
      "title": "Python Automation Scripts",
      "status": "Completed",
      "statusBadge": "done",
      "tags": [
        "Python Automation",
        "Heavy Data Processing",
        "Data Validation",
        "Operational Reporting",
        "Workflow Automation"
      ],
      "summary": "Python automation scripts created to handle ad hoc data requests, including heavy datasets. Used for data cleaning, validation, consolidation, and generating report-ready outputs based on operational requirements and supervisor requests.",
      "highlights": [
        "Built flexible scripts that adapt to different data formats and changing requirements",
        "Handled heavy datasets by automating cleaning, validation, and consolidation workflows",
        "Reduced repetitive manual processing by converting multi-step tasks into repeatable scripts",
        "Improved data consistency through validation checks and structured output generation",
        "Delivered report-ready files aligned with operational and supervisor data requests"
      ],
      "imageSets": [
        { "folder": "images/projects", "prefix": "script", "start": 1, "end": 4, "ext": "png" }
      ],
      "extraImages": [],
      "video": "https://drive.google.com/file/d/1Bs9qXwHjcYDsJ2y_xBmt4GL8Wn-Zoz3X/view?usp=drive_link",
      "note": "Demo video shows a representative automation workflow. Scripts vary depending on dataset size and request requirements."
    }
  ]
}